Repository: qiaob/baobox_mac
Catalog: Sources/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# screenshot.settings.mixAudioHelp
source: With both system audio and microphone on, merging into one track plays correctly everywhere. GIF output is silent, capped at 10 fps and 720px wide — best for short clips.
zh_hans: 同时录系统声音与麦克风时，混为单轨可在所有播放器正常出声。GIF 输出无声音、最高 10 帧/秒、宽度缩至 720px，适合短片段。

# claudecode.name
source: Claude Code Assistant
zh_hans: Claude Code 助手

# claudecode.hotkey.center
source: Open Claude Code Center
zh_hans: 打开 Claude Code 中心

# claudecode.hotkey.center.subtitle
source: Open the sessions / usage / audit center window
zh_hans: 打开会话 / 用量 / 审计中心窗口

# claudecode.menu.notInstalled
source: Claude Code not detected (~/.claude missing)
zh_hans: 未检测到 Claude Code（~/.claude 不存在）

# claudecode.menu.noActivity
source: No activity
zh_hans: 暂无活动

# claudecode.menu.noSessions
source: No sessions yet
zh_hans: 暂无会话

# claudecode.menu.browseSessions
source: Browse Session History…
zh_hans: 浏览会话历史…

# claudecode.menu.noWindow
source: No active usage window
zh_hans: 当前无活跃额度窗口

# claudecode.menu.usageReport
source: Usage Report…
zh_hans: 用量报表…

# claudecode.menu.todayChanges
source: Today's Changes…
zh_hans: 今日改动…

# claudecode.menu.notifications
source: Completion & Waiting Notifications
zh_hans: 完成 / 等待通知

# claudecode.menu.today %@
source: Today %@
zh_hans: 今日 %@

# claudecode.menu.quota %@ %@ %@
source: 5h: %1$@ ≈ %2$@ · resets in %3$@
zh_hans: 5 小时：已用 %1$@ ≈ %2$@ · %3$@ 后重置

# claudecode.menu.quotaWeek %@ %@ %@
source: Week: %1$@ ≈ %2$@ · resets in %3$@
zh_hans: 本周：已用 %1$@ ≈ %2$@ · %3$@ 后重置

# claudecode.menu.noWeekWindow
source: No usage this week
zh_hans: 本周暂无用量

# claudecode.center.title
source: Claude Code Center
zh_hans: Claude Code 中心

# claudecode.center.tab.sessions
source: Sessions
zh_hans: 会话

# claudecode.center.tab.usage
source: Usage
zh_hans: 用量

# claudecode.center.tab.audit
source: Audit
zh_hans: 审计

# claudecode.common.refresh
source: Refresh
zh_hans: 刷新

# claudecode.common.installed
source: Installed
zh_hans: 已安装

# claudecode.common.save
source: Save
zh_hans: 保存

# claudecode.common.copied
source: Copied
zh_hans: 已复制

# claudecode.common.remove
source: Remove
zh_hans: 移除

# claudecode.common.writeFailed
source: Write failed
zh_hans: 写入失败

# claudecode.sessions.search
source: Search title or project
zh_hans: 搜索标题或项目

# claudecode.sessions.rowHint
source: Double-click to resume; right-click for more actions
zh_hans: 双击续接；右键更多操作

# claudecode.sessions.empty
source: No sessions
zh_hans: 没有会话

# claudecode.sessions.resume
source: Resume
zh_hans: 续接

# claudecode.sessions.copyCommand
source: Copy Resume Command
zh_hans: 复制续接命令

# claudecode.sessions.export
source: Export Markdown
zh_hans: 导出 Markdown

# claudecode.sessions.delete
source: Delete
zh_hans: 删除

# claudecode.sessions.exportFailed
source: Export failed
zh_hans: 导出失败

# claudecode.sessions.deleteConfirm.title
source: Delete this session?
zh_hans: 删除该会话？

# claudecode.sessions.deleteConfirm.message
source: This permanently deletes the session's JSONL file and cannot be undone.
zh_hans: 将永久删除该会话的 JSONL 文件，无法恢复。

# claudecode.usage.windowTitle
source: Current Usage Window
zh_hans: 当前额度窗口

# claudecode.usage.budgetUsed %@ %@
source: %1$@ / %2$@ tokens used
zh_hans: 已用 %1$@ / %2$@ token

# claudecode.usage.metric.used
source: Tokens Used
zh_hans: 已用 Token

# claudecode.usage.metric.cost
source: Cost (est.)
zh_hans: 费用（估算）

# claudecode.usage.metric.reset
source: Until Reset
zh_hans: 后重置

# claudecode.usage.detail
source: Breakdown (Last 30 Days)
zh_hans: 用量明细（近 30 天）

# claudecode.usage.dim.day
source: By Day
zh_hans: 按天

# claudecode.usage.dim.project
source: By Project
zh_hans: 按项目

# claudecode.usage.dim.model
source: By Model
zh_hans: 按模型

# claudecode.usage.col.date
source: Date
zh_hans: 日期

# claudecode.usage.col.project
source: Project
zh_hans: 项目

# claudecode.usage.col.model
source: Model
zh_hans: 模型

# claudecode.usage.total
source: Total
zh_hans: 合计

# claudecode.usage.col.input
source: Input
zh_hans: 输入

# claudecode.usage.col.output
source: Output
zh_hans: 输出

# claudecode.usage.col.cacheWrite
source: Cache W
zh_hans: 缓存写

# claudecode.usage.col.cacheRead
source: Cache R
zh_hans: 缓存读

# claudecode.usage.col.cost
source: Cost (est.)
zh_hans: 费用（估算）

# claudecode.usage.empty
source: No recent usage data
zh_hans: 近期无用量数据

# claudecode.usage.unpricedNote
source: Includes unknown models; cost may be underestimated.
zh_hans: 含未知模型，费用可能偏低。

# claudecode.usage.weekCard.title
source: Weekly window
zh_hans: 本周窗口

# claudecode.usage.weekCard.rolling
source: Rolling 7 days
zh_hans: 近 7 天滚动

# claudecode.usage.weekCard.fixed %@
source: Fixed reset: %@
zh_hans: 固定重置：%@

# claudecode.usage.weekFootnote %@ %@
source: This week (7 days): %1$@ ≈ %2$@ (est.)
zh_hans: 本周合计（近 7 天）：%1$@ ≈ %2$@（估算）

# claudecode.usage.countdown.dayHour %lld %lld
source: %1$lldd %2$lldh
zh_hans: %1$lld 天 %2$lld 小时

# claudecode.usage.invocations
source: Invocation Stats
zh_hans: 调用统计

# claudecode.usage.range
source: Range
zh_hans: 统计范围

# claudecode.usage.range.days7
source: Last 7 days
zh_hans: 近 7 天

# claudecode.usage.range.days30
source: Last 30 days
zh_hans: 近 30 天

# claudecode.usage.inv.skills
source: Skills / Slash Commands
zh_hans: Skill / 斜杠命令

# claudecode.usage.inv.mcp
source: MCP Tools
zh_hans: MCP 工具

# claudecode.usage.inv.builtin
source: Built-in Tools
zh_hans: 内置工具

# claudecode.usage.inv.empty
source: No invocations
zh_hans: 无调用记录

# claudecode.audit.date
source: Date
zh_hans: 日期

# claudecode.audit.empty
source: No changes recorded that day
zh_hans: 当日没有改动记录

# claudecode.audit.projectCount %lld
source: %lld changes
zh_hans: %lld 次改动

# claudecode.audit.summary %lld %lld
source: %1$lld projects · %2$lld edits
zh_hans: %1$lld 个项目 · %2$lld 处改动

# claudecode.audit.reveal
source: Reveal in Finder
zh_hans: 在访达中显示

# claudecode.settings.notInstalled
source: Claude Code not detected (~/.claude missing). Install and run Claude Code once to use this module.
zh_hans: 未检测到 Claude Code（~/.claude 不存在）。安装并运行一次 Claude Code 后即可使用本模块。

# claudecode.settings.status.version %@
source: CLI %@
zh_hans: CLI 版本 %@

# claudecode.settings.status.versionUnknown
source: CLI not detected
zh_hans: 未检测到 CLI

# claudecode.settings.status.hooksOn
source: Event reporting on
zh_hans: 事件上报已启用

# claudecode.settings.status.hooksOff
source: Event reporting off
zh_hans: 事件上报未启用

# claudecode.settings.status.sessions %lld
source: %lld sessions
zh_hans: %lld 个会话

# claudecode.settings.section.notifications
source: Notifications
zh_hans: 通知

# claudecode.settings.section.config
source: Configuration
zh_hans: 配置

# claudecode.settings.section.menu
source: Sessions
zh_hans: 会话

# claudecode.settings.rowformat.section
source: Session rows (Quick Resume panel)
zh_hans: 会话行（快速续接面板）

# claudecode.settings.rowformat.picker
source: Row format
zh_hans: 展示格式

# claudecode.settings.rowformat.preview
source: Preview
zh_hans: 预览

# claudecode.settings.rowformat.builtinHint
source: Built-in formats are read-only. Create a custom format to adjust fields.
zh_hans: 内置方案不可编辑；可新建自定义方案调整字段。

# claudecode.settings.rowformat.newScheme
source: New Custom Format
zh_hans: 新建自定义方案

# claudecode.settings.rowformat.editSection
source: Custom Format
zh_hans: 自定义方案

# claudecode.settings.rowformat.name
source: Format name
zh_hans: 方案名称

# claudecode.settings.rowformat.deleteScheme
source: Delete Format
zh_hans: 删除此方案

# claudecode.rowformat.preset.compact
source: Compact
zh_hans: 简洁

# claudecode.rowformat.preset.standard
source: Standard
zh_hans: 标准

# claudecode.rowformat.preset.detailed
source: Detailed
zh_hans: 详细

# claudecode.rowformat.customDefault
source: Custom Format
zh_hans: 自定义方案

# claudecode.rowformat.previewTitle
source: Sample session title
zh_hans: 示例会话标题

# claudecode.rowformat.field.project
source: Project
zh_hans: 项目

# claudecode.rowformat.field.path
source: Directory path
zh_hans: 目录路径

# claudecode.rowformat.field.model
source: Model
zh_hans: 模型

# claudecode.rowformat.field.context
source: Context size
zh_hans: 上下文大小

# claudecode.rowformat.field.fileSize
source: File size
zh_hans: 文件大小

# claudecode.rowformat.field.time
source: Last active
zh_hans: 最后活跃

# claudecode.menu.quickSwitch
source: Quick Resume…
zh_hans: 快速续接…

# claudecode.hotkey.quickswitch
source: Quick Resume Panel
zh_hans: 快速续接面板

# claudecode.hotkey.quickswitch.subtitle
source: Spotlight-style search & resume sessions
zh_hans: Spotlight 式搜索并续接会话

# claudecode.quickswitch.placeholder
source: Search sessions by title, project, or path
zh_hans: 搜索会话标题、项目或路径

# claudecode.quickswitch.empty
source: No matching sessions
zh_hans: 无匹配会话

# claudecode.quickswitch.count %lld
source: %lld sessions
zh_hans: %lld 个会话

# claudecode.quickswitch.hint.select
source: Select
zh_hans: 选择

# claudecode.quickswitch.hint.resume
source: Resume
zh_hans: 续接

# claudecode.quickswitch.hint.copy
source: Copy command
zh_hans: 复制命令

# claudecode.quickswitch.hint.close
source: Close
zh_hans: 关闭

# claudecode.settings.notify.soundPicker
source: Alert sound
zh_hans: 提示音

# claudecode.settings.notify.soundDefault
source: System default
zh_hans: 系统默认

# claudecode.settings.notify.speechSection
source: Speech
zh_hans: 语音朗读

# claudecode.settings.notify.speech
source: Speak notifications aloud
zh_hans: 完成 / 等待时语音朗读

# claudecode.settings.notify.speechText
source: Speech text
zh_hans: 朗读文案

# claudecode.settings.notify.speechPlaceholder
source: e.g. {project} is done
zh_hans: 如:{project} 干完了

# claudecode.settings.notify.speechHelp
source: Speaks with the system voice. Leave empty to read the notification title; {project} is replaced with the project name.
zh_hans: 使用系统语音朗读。留空朗读通知标题;{project} 会替换为项目名。

# claudecode.settings.notify.preview
source: Preview
zh_hans: 试听

# claudecode.notify.previewProject
source: demo-project
zh_hans: 示例项目

# claudecode.settings.statusline.scheme
source: Format
zh_hans: 方案

# claudecode.statusline.seg.model
source: Model
zh_hans: 模型

# claudecode.statusline.seg.dir
source: Directory
zh_hans: 目录

# claudecode.statusline.seg.gitBranch
source: Git branch
zh_hans: Git 分支

# claudecode.statusline.seg.sessionName
source: Session name
zh_hans: 会话名

# claudecode.statusline.seg.context
source: Context used %
zh_hans: 上下文占用 %

# claudecode.statusline.seg.contextTokens
source: Context tokens
zh_hans: 上下文 tokens

# claudecode.statusline.seg.cost
source: Session cost (est.)
zh_hans: 会话花费（估算）

# claudecode.statusline.seg.duration
source: Session duration
zh_hans: 会话时长

# claudecode.statusline.seg.lines
source: Lines +/-
zh_hans: 代码行 +/-

# claudecode.statusline.seg.pr
source: PR number
zh_hans: PR 编号

# claudecode.statusline.seg.outputStyle
source: Output style
zh_hans: 输出风格

# claudecode.statusline.seg.rateLimit5h
source: 5-hour limit %
zh_hans: 5 小时额度 %

# claudecode.statusline.seg.version
source: CLI version
zh_hans: CLI 版本

# claudecode.statusline.seg.time
source: Time
zh_hans: 时间

# claudecode.settings.notify.alertStyle
source: Alert style
zh_hans: 提醒方式

# claudecode.settings.notify.style.none
source: Silent
zh_hans: 仅通知

# claudecode.settings.notify.style.sound
source: Sound
zh_hans: 提示音

# claudecode.settings.notify.style.speech
source: Speech
zh_hans: 语音朗读

# claudecode.settings.section.maintenance
source: Maintenance
zh_hans: 维护

# claudecode.settings.notify.section
source: Notifications
zh_hans: 通知

# claudecode.settings.notify.enabled
source: Completion & waiting notifications
zh_hans: 完成 / 等待通知

# claudecode.settings.notify.enabledHelp
source: Send a system notification when a task finishes or Claude awaits confirmation. Requires the Baobox event-reporting hooks below.
zh_hans: 任务完成或 Claude 等待确认时发送系统通知，需要下方的 Baobox 事件上报 hooks。

# claudecode.settings.notify.sound
source: Play sound
zh_hans: 提示音

# claudecode.settings.notify.budgetSection
source: Usage budget
zh_hans: 额度预算

# claudecode.settings.notify.budget
source: Per-window budget (k tokens)
zh_hans: 每窗口预算（千 token）

# claudecode.settings.notify.budgetHelp
source: Claude subscriptions limit usage per 5-hour rolling window, but the exact allowance is not published. Baobox estimates tokens used in the current window (input + output + cache) from local session logs. Enter your own estimate of how much one window allows — in thousands of tokens, e.g. 50000 = 50M — and the usage progress bar plus the 80% alert will be based on it. 0 means no budget: only usage is shown, no alert.
zh_hans: Claude 订阅按「5 小时滚动窗口」限量，但官方不公布具体额度。Baobox 会从本地会话日志估算当前窗口已用的 token 总量（输入 + 输出 + 缓存）。在这里填入你自己估计的每窗口可用量作为基准（单位：千 token，如填 50000 即 5000 万），用量进度条和「达 80% 提醒」都以它为分母；填 0 表示不设预算，只展示已用量、不提醒。

# claudecode.settings.notify.budgetAlert
source: Alert at 80% of budget
zh_hans: 用量达 80% 时提醒

# claudecode.settings.notify.budgetRestore
source: Notify when the window resets
zh_hans: 额度窗口重置时提醒

# claudecode.settings.notify.weeklyBudget
source: Weekly budget (k tokens)
zh_hans: 周额度预算（k tokens）

# claudecode.settings.notify.weeklyFixed
source: Align to fixed weekly reset
zh_hans: 按固定重置时间对齐

# claudecode.settings.notify.weeklyWeekday
source: Reset weekday
zh_hans: 重置星期

# claudecode.settings.notify.weeklyHour
source: Reset hour
zh_hans: 重置小时

# claudecode.settings.notify.weeklyHint
source: Match the weekly reset shown in Claude /usage; leave off for a rolling 7-day estimate
zh_hans: 对照 Claude /usage 的周重置时间填写；留空按近 7 天滚动估算

# claudecode.settings.notify.hooksSection
source: Event-reporting hooks
zh_hans: 事件上报 hooks

# claudecode.settings.notify.installHooks
source: Install hooks
zh_hans: 安装 hooks

# claudecode.settings.notify.removeHooks
source: Remove hooks
zh_hans: 移除 hooks

# claudecode.settings.notify.hooksHelp
source: Installs Stop / Notification / SessionStart / UserPromptSubmit hooks that append events for Baobox to watch. Your other hooks are preserved.
zh_hans: 安装 Stop / Notification / SessionStart / UserPromptSubmit 事件上报 hooks 供 Baobox 监听，保留你的其他 hooks。

# claudecode.settings.config.behavior
source: Behavior
zh_hans: 行为

# claudecode.settings.config.defaultMode
source: Default permission mode
zh_hans: 默认权限模式

# claudecode.settings.config.defaultModeHelp
source: Default permission mode for new sessions.
zh_hans: 新会话启动时的默认权限模式。

# claudecode.settings.config.mode.default
source: Default (ask each time)
zh_hans: 默认（每次询问）

# claudecode.settings.config.mode.acceptEdits
source: Accept edits
zh_hans: 自动接受编辑

# claudecode.settings.config.mode.plan
source: Plan mode
zh_hans: 计划模式

# claudecode.settings.config.mode.bypass
source: Bypass all prompts (dangerous)
zh_hans: 跳过所有确认（危险）

# claudecode.settings.config.mode.bypassWarning
source: Skips every permission prompt — Claude can run anything without asking. Use with caution.
zh_hans: 跳过所有权限确认，Claude 可无提示执行任何操作，请谨慎。

# claudecode.settings.config.model
source: Default model
zh_hans: 默认模型

# claudecode.settings.config.model.default
source: Follow default
zh_hans: 跟随默认

# claudecode.settings.config.modelHelp
source: Model alias written to settings.json; 'Follow default' removes the key.
zh_hans: 写入 settings.json 的模型别名；「跟随默认」则移除该键。

# claudecode.settings.config.cleanup
source: Session retention
zh_hans: 会话保留天数

# claudecode.settings.config.cleanup.default
source: Follow default
zh_hans: 跟随默认

# claudecode.settings.config.cleanup.days %lld
source: %lld days
zh_hans: %lld 天

# claudecode.settings.config.cleanupHelp
source: Sessions older than this are auto-cleaned by Claude Code; 'Follow default' removes the key.
zh_hans: 早于该天数的会话会被 Claude Code 自动清理；「跟随默认」则移除该键。

# claudecode.settings.config.permissions
source: Permission presets
zh_hans: 权限规则

# claudecode.settings.config.preset.packageManagers
source: Package managers (npm / pnpm / yarn)
zh_hans: 包管理（npm / pnpm / yarn）

# claudecode.settings.config.preset.buildTest
source: Build & test (make / eslint / pytest …)
zh_hans: 构建与测试（make / eslint / pytest 等）

# claudecode.settings.config.preset.gitRead
source: Git read-only (status / log / diff)
zh_hans: Git 只读（status / log / diff）

# claudecode.settings.config.preset.gitWrite
source: Git write (add / commit / push)
zh_hans: Git 写入（add / commit / push）

# claudecode.settings.config.preset.fileRead
source: File read
zh_hans: 文件读取

# claudecode.settings.config.presetsHelp
source: Checking a group adds its commands to permissions.allow; unchecking removes them all.
zh_hans: 勾选后把对应命令加入 permissions.allow；取消则移除该组全部规则。

# claudecode.settings.config.advanced
source: Advanced
zh_hans: 高级

# claudecode.settings.config.allowList
source: Allow rules
zh_hans: allow 规则

# claudecode.settings.config.denyList
source: Deny rules
zh_hans: deny 规则

# claudecode.settings.config.noRules
source: No rules
zh_hans: 暂无规则

# claudecode.settings.config.addRule
source: Add
zh_hans: 添加

# claudecode.settings.config.rulePlaceholder
source: e.g. Bash(npm run *)
zh_hans: 如 Bash(npm run *)

# claudecode.settings.config.guard
source: Dangerous-command guard
zh_hans: 危险命令卫士

# claudecode.settings.config.guardEnabled
source: Enable dangerous-command guard
zh_hans: 启用危险命令卫士

# claudecode.settings.config.guardHelp
source: Installs a PreToolUse(Bash) hook; matching commands are blocked and the reason is fed back to Claude. A blacklist guards against slips, not deliberate bypass.
zh_hans: 安装 PreToolUse(Bash) hook，命中规则的命令会被阻止并把原因反馈给 Claude。黑名单只防手滑，不防刻意绕过。

# claudecode.settings.config.guardCustom
source: Custom rules (regex)
zh_hans: 自定义规则（正则）

# claudecode.settings.config.guardRulePlaceholder
source: ERE regex matched against the command JSON
zh_hans: ERE 正则，匹配整行命令 JSON

# claudecode.settings.config.guardReset
source: Restore default rules
zh_hans: 恢复默认规则

# claudecode.settings.config.privacy
source: Privacy
zh_hans: 隐私

# claudecode.settings.config.privacy.telemetry
source: Disable telemetry
zh_hans: 关闭遥测

# claudecode.settings.config.privacy.errorReporting
source: Disable error reporting
zh_hans: 关闭错误上报

# claudecode.settings.config.privacy.traffic
source: Disable non-essential network traffic
zh_hans: 禁用非必要网络请求

# claudecode.settings.config.privacyHelp
source: Maps to env flags in settings.json; unchecking removes only that key and leaves your other env vars intact.
zh_hans: 映射 settings.json 的 env 开关；取消勾选仅移除对应键，不影响你自设的其他环境变量。

# claudecode.settings.config.commit
source: Commit attribution
zh_hans: 提交署名

# claudecode.settings.config.coauthored
source: Add Co-Authored-By: Claude to commits
zh_hans: 在提交中署名 Co-Authored-By: Claude

# claudecode.settings.config.coauthoredHelp
source: Affects future commits only; does not rewrite history.
zh_hans: 仅影响以后的提交，不改写历史。

# claudecode.settings.config.claudeMd.global
source: Global (~/.claude/CLAUDE.md)
zh_hans: 全局（~/.claude/CLAUDE.md）

# claudecode.settings.config.claudeMd.open
source: Open
zh_hans: 打开

# claudecode.settings.config.claudeMd.create
source: Create from template
zh_hans: 从模板创建

# claudecode.settings.config.claudeMdHelp
source: Lists global and per-project CLAUDE.md files; missing ones can be created from a built-in template.
zh_hans: 列出全局与各已知项目的 CLAUDE.md；缺失可从内置模板创建。

# claudecode.settings.statusline.foreignWarning
source: An existing custom statusLine was found; applying will overwrite it.
zh_hans: 检测到已有自定义 statusLine，应用将覆盖它。

# claudecode.settings.statusline.segmentsSection
source: Segments
zh_hans: 显示段

# claudecode.settings.statusline.model
source: Model
zh_hans: 模型

# claudecode.settings.statusline.dir
source: Directory
zh_hans: 目录

# claudecode.settings.statusline.gitBranch
source: Git branch
zh_hans: Git 分支

# claudecode.settings.statusline.cost
source: Session cost (est.)
zh_hans: 会话花费（估算）

# claudecode.settings.statusline.time
source: Time
zh_hans: 时间

# claudecode.settings.statusline.separator
source: Separator
zh_hans: 分隔符

# claudecode.settings.statusline.previewSection
source: Preview
zh_hans: 预览

# claudecode.settings.statusline.apply
source: Apply to Claude Code
zh_hans: 应用到 Claude Code

# claudecode.settings.statusline.remove
source: Remove
zh_hans: 移除

# claudecode.settings.statusline.installed
source: Baobox statusline applied
zh_hans: 已应用 Baobox statusline

# claudecode.settings.statusline.help
source: Pick the segments to show; a shell script is generated at ~/.claude/baobox-statusline.sh and takes effect for new sessions.
zh_hans: 勾选要显示的段并生成 shell 脚本写入 ~/.claude/baobox-statusline.sh，新会话即生效。

# claudecode.settings.statusline.overwriteConfirm.title
source: Overwrite existing statusLine?
zh_hans: 覆盖已有 statusLine？

# claudecode.settings.statusline.overwriteConfirm.message
source: settings.json already has a non-Baobox statusLine; applying will replace it.
zh_hans: settings.json 中已有一个非 Baobox 的 statusLine，应用后将被替换。

# claudecode.settings.statusline.overwriteConfirm.confirm
source: Overwrite
zh_hans: 覆盖

# claudecode.settings.mcp.empty
source: No user-level MCP servers
zh_hans: 没有用户级 MCP 服务器

# claudecode.settings.mcp.add
source: Add server
zh_hans: 添加服务器

# claudecode.settings.mcp.help
source: Manages user-level mcpServers in ~/.claude.json.
zh_hans: 管理 ~/.claude.json 顶层的用户级 mcpServers。

# claudecode.settings.mcp.addTitle
source: Add MCP Server
zh_hans: 添加 MCP 服务器

# claudecode.settings.mcp.name
source: Name
zh_hans: 名称

# claudecode.settings.mcp.type
source: Type
zh_hans: 类型

# claudecode.settings.mcp.type.stdio
source: stdio (local command)
zh_hans: stdio（本地命令）

# claudecode.settings.mcp.type.http
source: http (remote URL)
zh_hans: http（远程 URL）

# claudecode.settings.mcp.command
source: Command
zh_hans: 命令

# claudecode.settings.mcp.args
source: Arguments (space-separated)
zh_hans: 参数（空格分隔）

# claudecode.settings.mcp.env
source: Environment (KEY=value per line)
zh_hans: 环境变量（每行 KEY=值）

# claudecode.settings.mcp.deleteConfirm.title %@
source: Delete MCP server %@?
zh_hans: 删除 MCP 服务器 %@？

# claudecode.settings.mcp.deleteConfirm.message
source: Removes this server from ~/.claude.json.
zh_hans: 将从 ~/.claude.json 移除该服务器配置。

# claudecode.settings.maint.diskSection
source: Disk usage
zh_hans: 磁盘占用

# claudecode.settings.maint.projects %@
source: Sessions: %@
zh_hans: 会话记录：%@

# claudecode.settings.maint.todos %@
source: Todos: %@
zh_hans: 待办：%@

# claudecode.settings.maint.shellSnapshots %@
source: Shell snapshots: %@
zh_hans: Shell 快照：%@

# claudecode.settings.maint.other %@
source: Other: %@
zh_hans: 其他：%@

# claudecode.settings.maint.total %@
source: Total: %@
zh_hans: 总计：%@

# claudecode.settings.maint.fileCount %lld
source: %lld session files
zh_hans: %lld 个会话文件

# claudecode.settings.maint.cleanupOlderThan
source: Clean up older than
zh_hans: 清理早于

# claudecode.settings.maint.cleanup
source: Clean up
zh_hans: 清理

# claudecode.settings.maint.cleanupConfirm.title
source: Clean up old sessions?
zh_hans: 清理旧会话？

# claudecode.settings.maint.cleanupConfirm.message %lld
source: Deletes session files older than %lld days. This cannot be undone.
zh_hans: 将删除早于 %lld 天的会话文件，无法恢复。

# claudecode.settings.maint.cleanupResult %lld %@
source: Deleted %1$lld files, freed %2$@.
zh_hans: 已删除 %1$lld 个文件，释放 %2$@。

# claudecode.settings.maint.versionSection
source: Version
zh_hans: 版本

# claudecode.settings.maint.localVersion %@
source: Installed: %@
zh_hans: 本机版本：%@

# claudecode.settings.maint.checking
source: Checking…
zh_hans: 检查中…

# claudecode.settings.maint.checkFailed
source: Check failed (possibly offline)
zh_hans: 检查失败（可能离线）

# claudecode.settings.maint.latestVersion %@
source: Latest: %@
zh_hans: 最新版本：%@

# claudecode.settings.maint.checkUpdate
source: Check for latest
zh_hans: 检查最新版

# claudecode.settings.maint.copyUpgrade
source: Copy upgrade command
zh_hans: 复制升级命令

# claudecode.session.untitled
source: (untitled session)
zh_hans: (无标题会话)

# claudecode.status.running %lld
source: %lld running
zh_hans: %lld 运行中

# claudecode.status.waiting %lld
source: %lld awaiting confirmation
zh_hans: %lld 等待确认

# claudecode.status.inferredActive %lld
source: %lld session(s) active (inferred)
zh_hans: %lld 个会话活跃（推断）

# claudecode.notify.stop.title %@
source: Session finished · %@
zh_hans: 会话完成 · %@

# claudecode.notify.waiting.title %@
source: Awaiting confirmation · %@
zh_hans: 等你确认 · %@
